Tekla Open API Reference for Tekla Structures 2025
SecondaryTypeAttribute Properties
The SecondaryTypeAttribute type exposes the following members.
Properties
Name | Description
Type
 The custom attribute [SecondaryType()] uses this to store the secondary type to the system. This is not to be used by itself.
Top
See Also
Reference
SecondaryTypeAttribute Class
Tekla.Structures.Plugins Namespace